Repository: pooryafayazi/FastAPI-Cost-Manager
Catalog: core/i18n/translations/*/LC_MESSAGES/messages.po
Languages: fa

source: Hello, this is a message in your language!
fa: سلام! این پیام به زبان دلخواه شماست.

source: Authentication failed: user_id missing in token payload.
fa: احراز هویت ناموفق: شناسه کاربر در توکن وجود ندارد.

source: Authentication failed: token type is not valid.
fa: احراز هویت ناموفق: نوع توکن معتبر نیست.

source: Authentication failed: token has expired.
fa: احراز هویت ناموفق: توکن منقضی شده است.

source: Authentication failed: invalid signature.
fa: احراز هویت ناموفق: امضای توکن نامعتبر است.

source: Authentication failed: decode failed.
fa: احراز هویت ناموفق: خطا در Decode توکن.

source: Authentication failed: {error}
fa: احراز هویت ناموفق: {error}

source: Forbidden: CSRF token invalid or missing.
fa: دسترسی ممنوع: توکن CSRF نامعتبر است یا وجود ندارد.

source: Token has expired.
fa: توکن منقضی شده است.

source: Invalid token.
fa: توکن نامعتبر است.

source: Invalid token type.
fa: نوع توکن نامعتبر است.

source: Invalid token payload.
fa: payload توکن نامعتبر است.

source: Missing access token cookie.
fa: کوکی توکن دسترسی یافت نشد.

source: Missing refresh token cookie.
fa: کوکی توکن نوسازی یافت نشد.

source: Object not found.
fa: موردی یافت نشد.

source: Expense {id} updated successfully.
fa: هزینه {id} با موفقیت به‌روزرسانی شد.

source: Expense with id {id} deleted successfully.
fa: هزینه با شناسه {id} با موفقیت حذف شد.

source: Username already exists!
fa: نام کاربری از قبل وجود دارد!

source: User created.
fa: کاربر با موفقیت ایجاد شد.

source: Invalid username or password!
fa: نام کاربری یا رمز عبور نادرست است!

source: Login successful.
fa: ورود با موفقیت انجام شد.

source: Logged out successfully.
fa: خروج با موفقیت انجام شد.
